ls:	file format ELF64-x86-64

.debug_info contents:
0x00000000: Compile Unit: length = 0x0000002a version = 0x0002 abbr_offset = 0x0000 addr_size = 0x08 (next unit at 0x0000002e)

0x0000000b: DW_TAG_compile_unit
              DW_AT_stmt_list	(0x00000000)
              DW_AT_low_pc	(0x0000000000402f70)
              DW_AT_high_pc	(0x0000000000402f9b)
              DW_AT_name	("../sysdeps/x86_64/start.S")
              DW_AT_comp_dir	("/home/dongkwan/ParsFI-src/helper/ct-ng_conf/8.2/x86_64/.build/src/glibc-2.26/csu")
              DW_AT_producer	("GNU AS 2.30")
              DW_AT_language	(DW_LANG_Mips_Assembler)
0x0000002e: Compile Unit: length = 0x00000074 version = 0x0004 abbr_offset = 0x0014 addr_size = 0x08 (next unit at 0x000000a6)

0x00000039: DW_TAG_compile_unit
              DW_AT_producer	("GNU C11 8.2.0 -mtune=generic -march=x86-64 -g -O2 -O2 -std=gnu11 -fgnu89-inline -fmerge-all-constants -frounding-math -fno-stack-protector -ftls-model=initial-exec")
              DW_AT_language	(DW_LANG_C99)
              DW_AT_name	("init.c")
              DW_AT_comp_dir	("/home/dongkwan/ParsFI-src/helper/ct-ng_conf/8.2/x86_64/.build/src/glibc-2.26/csu")
              DW_AT_stmt_list	(0x0000005e)

0x0000004b:   DW_TAG_base_type
                DW_AT_byte_size	(0x01)
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_name	("unsigned char")

0x00000052:   DW_TAG_base_type
                DW_AT_byte_size	(0x02)

                DW_AT_name	("__clock_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types.h")
                DW_AT_decl_line	(144)
                DW_AT_decl_column	(0x1b)
                DW_AT_type	(cu + 0x0074 "long int")

0x000001d3:   DW_TAG_typedef
                DW_AT_name	("__time_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types.h")
                DW_AT_decl_line	(148)
                DW_AT_decl_column	(0x1a)
                DW_AT_type	(cu + 0x0074 "long int")

0x000001df:   DW_TAG_pointer_type
                DW_AT_byte_size	(0x08)

0x000001e1:   DW_TAG_typedef
                DW_AT_name	("__blksize_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types.h")
                DW_AT_decl_line	(162)
                DW_AT_decl_column	(0x1d)
                DW_AT_type	(cu + 0x0074 "long int")

0x000001ed:   DW_TAG_typedef
                DW_AT_name	("__blkcnt_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types.h")
                DW_AT_decl_line	(167)
                DW_AT_decl_column	(0x1c)
                DW_AT_type	(cu + 0x0074 "long int")

0x000001f9:   DW_TAG_typedef
                DW_AT_name	("__syscall_slong_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types.h")
                DW_AT_decl_line	(184)
                DW_AT_decl_column	(0x21)
                DW_AT_type	(cu + 0x0074 "long int")

0x00000205:   DW_TAG_pointer_type
                DW_AT_byte_size	(0x08)
                DW_AT_type	(cu + 0x0143 "char")

0x0000020b:   DW_TAG_base_type
                DW_AT_byte_size	(0x01)
                DW_AT_encoding	(DW_ATE_signed_char)
                DW_AT_name	("char")

0x00000212:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0143 "char")

0x00000217:   DW_TAG_typedef
                DW_AT_name	("__sig_atomic_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types.h")
                DW_AT_decl_line	(203)
                DW_AT_decl_column	(0x0d)
                DW_AT_type	(cu + 0x0057 "int")

0x00000223:   DW_TAG_typedef
                DW_AT_name	("ino_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/sys/types.h")
                DW_AT_decl_line	(48)
                DW_AT_decl_column	(0x11)
                DW_AT_type	(cu + 0x00b7 "__ino_t")

0x0000022f:   DW_TAG_typedef
                DW_AT_name	("dev_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/sys/types.h")
                DW_AT_decl_line	(60)
                DW_AT_decl_column	(0x11)
                DW_AT_type	(cu + 0x0093 "__dev_t")

0x0000023b:   DW_TAG_typedef
                DW_AT_name	("gid_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/sys/types.h")
                DW_AT_decl_line	(65)
                DW_AT_decl_column	(0x11)
                DW_AT_type	(cu + 0x00ab "__gid_t")

0x00000247:   DW_TAG_typedef
                DW_AT_name	("mode_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/sys/types.h")
                DW_AT_decl_line	(70)
                DW_AT_decl_column	(0x12)
                DW_AT_type	(cu + 0x00c3 "__mode_t")

0x00000253:   DW_TAG_typedef
                DW_AT_name	("uid_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/sys/types.h")
                DW_AT_decl_line	(80)
                DW_AT_decl_column	(0x11)
                DW_AT_type	(cu + 0x009f "__uid_t")

0x0000025f:   DW_TAG_typedef
                DW_AT_name	("off_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/sys/types.h")
                DW_AT_decl_line	(86)
                DW_AT_decl_column	(0x11)
                DW_AT_type	(cu + 0x00db "__off_t")

0x0000026b:   DW_TAG_typedef
                DW_AT_name	("time_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/time_t.h")
                DW_AT_decl_line	(7)
                DW_AT_decl_column	(0x12)
                DW_AT_type	(cu + 0x010b "__time_t")

0x00000277:   DW_TAG_typedef
                DW_AT_name	("size_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/lib/gcc/x86_64-ubuntu-linux-gnu/8.2.0/include/stddef.h")
                DW_AT_decl_line	(216)
                DW_AT_decl_column	(0x17)
                DW_AT_type	(cu + 0x0042 "long unsigned int")

0x00000283:   DW_TAG_structure_type
                DW_AT_byte_size	(0x80)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/__sigset_t.h")
                DW_AT_decl_line	(5)
                DW_AT_decl_column	(0x09)
                DW_AT_sibling	(cu + 0x01d2)

0x0000028c:     DW_TAG_member
                  DW_AT_name	("__val")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/__sigset_t.h")
                  DW_AT_decl_line	(7)
                  DW_AT_decl_column	(0x15)
                  DW_AT_type	(cu + 0x01d2 "long unsigned int[]")
                  DW_AT_data_member_location	(0x00)

0x00000299:     NULL

0x0000029a:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0042 "long unsigned int")
                DW_AT_sibling	(cu + 0x01e2)

0x000002a3:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0042 "long unsigned int")
                  DW_AT_upper_bound	(0x0f)

0x000002a9:     NULL

0x000002aa:   DW_TAG_typedef
                DW_AT_name	("__sigset_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/__sigset_t.h")
                DW_AT_decl_line	(8)
                DW_AT_decl_column	(0x03)
                DW_AT_type	(cu + 0x01bb "structure ")

0x000002b6:   DW_TAG_typedef
                DW_AT_name	("sigset_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/sigset_t.h")
                DW_AT_decl_line	(7)
                DW_AT_decl_column	(0x14)
                DW_AT_type	(cu + 0x01e2 "__sigset_t")

0x000002c2:   DW_TAG_structure_type
                DW_AT_name	("timespec")
                DW_AT_byte_size	(0x10)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/struct_timespec.h")
                DW_AT_decl_line	(8)
                DW_AT_decl_column	(0x08)
                DW_AT_sibling	(cu + 0x0222)

0x000002cf:     DW_TAG_member
                  DW_AT_name	("tv_sec")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/struct_timespec.h")
                  DW_AT_decl_line	(10)
                  DW_AT_decl_column	(0x0c)
                  DW_AT_type	(cu + 0x010b "__time_t")
                  DW_AT_data_member_location	(0x00)

0x000002dc:     DW_TAG_member
                  DW_AT_name	("tv_nsec")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/struct_timespec.h")
                  DW_AT_decl_line	(11)
                  DW_AT_decl_column	(0x15)
                  DW_AT_type	(cu + 0x0131 "__syscall_slong_t")
                  DW_AT_data_member_location	(0x08)

0x000002e9:     NULL

0x000002ea:   DW_TAG_variable
                DW_AT_name	("_gl_cxxalias_dummy")
                DW_AT_decl_file	("/home/dongkwan/data/scripts/gnu_packages/coreutils/coreutils-8.29_gcc-8.2.0_x86_64_O0_debug/./lib/sys/select.h")
                DW_AT_decl_line	(726)
                DW_AT_decl_column	(0x01)
                DW_AT_type	(cu + 0x0057 "int")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x000002f7:   DW_TAG_base_type
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_name	("long long unsigned int")

0x000002fe:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0143 "char")
                DW_AT_sibling	(cu + 0x0246)

0x00000307:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0042 "long unsigned int")
                  DW_AT_upper_bound	(0x03)

0x0000030d:     NULL

0x0000030e:   DW_TAG_base_type
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_name	("long long int")

0x00000315:   DW_TAG_structure_type
                DW_AT_name	("winsize")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/ioctl-types.h")
                DW_AT_decl_line	(27)
                DW_AT_decl_column	(0x08)
                DW_AT_sibling	(cu + 0x028f)

0x00000322:     DW_TAG_member
                  DW_AT_name	("ws_row")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/ioctl-types.h")
                  DW_AT_decl_line	(29)
                  DW_AT_decl_column	(0x18)
                  DW_AT_type	(cu + 0x0034 "short unsigned int")
                  DW_AT_data_member_location	(0x00)

0x0000032f:     DW_TAG_member
                  DW_AT_name	("ws_col")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/ioctl-types.h")
                  DW_AT_decl_line	(30)
                  DW_AT_decl_column	(0x18)
                  DW_AT_type	(cu + 0x0034 "short unsigned int")
                  DW_AT_data_member_location	(0x02)

0x0000033c:     DW_TAG_member
                  DW_AT_name	("ws_xpixel")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/ioctl-types.h")
                  DW_AT_decl_line	(31)
                  DW_AT_decl_column	(0x18)
                  DW_AT_type	(cu + 0x0034 "short unsigned int")
                  DW_AT_data_member_location	(0x04)

0x00000349:     DW_TAG_member
                  DW_AT_name	("ws_ypixel")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/ioctl-types.h")
                  DW_AT_decl_line	(32)
                  DW_AT_decl_column	(0x18)
                  DW_AT_type	(cu + 0x0034 "short unsigned int")
                  DW_AT_data_member_location	(0x06)

0x00000356:     NULL

0x00000357:   DW_TAG_structure_type
                DW_AT_name	("_IO_FILE")
                DW_AT_byte_size	(0xd8)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                DW_AT_decl_line	(241)
                DW_AT_decl_column	(0x08)
                DW_AT_sibling	(cu + 0x042a)

0x00000364:     DW_TAG_member
                  DW_AT_name	("_flags")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(242)
                  DW_AT_decl_column	(0x07)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x00)

0x00000371:     DW_TAG_member
                  DW_AT_name	("_IO_read_ptr")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(247)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x013d "char*")
                  DW_AT_data_member_location	(0x08)

0x0000037e:     DW_TAG_member
                  DW_AT_name	("_IO_read_end")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(248)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x013d "char*")
                  DW_AT_data_member_location	(0x10)

0x0000038b:     DW_TAG_member
                  DW_AT_name	("_IO_read_base")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(249)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x013d "char*")
                  DW_AT_data_member_location	(0x18)

0x00000398:     DW_TAG_member
                  DW_AT_name	("_IO_write_base")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(250)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x013d "char*")
                  DW_AT_data_member_location	(0x20)

0x000003a5:     DW_TAG_member
                  DW_AT_name	("_IO_write_ptr")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(251)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x013d "char*")
                  DW_AT_data_member_location	(0x28)

0x000003b2:     DW_TAG_member
                  DW_AT_name	("_IO_write_end")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(252)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x013d "char*")
                  DW_AT_data_member_location	(0x30)

0x000003bf:     DW_TAG_member
                  DW_AT_name	("_IO_buf_base")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(253)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x013d "char*")
                  DW_AT_data_member_location	(0x38)

0x000003cc:     DW_TAG_member
                  DW_AT_name	("_IO_buf_end")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(254)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x013d "char*")
                  DW_AT_data_member_location	(0x40)

0x000003d9:     DW_TAG_member
                  DW_AT_name	("_IO_save_base")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(256)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x013d "char*")
                  DW_AT_data_member_location	(0x48)

0x000003e7:     DW_TAG_member
                  DW_AT_name	("_IO_backup_base")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(257)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x013d "char*")
                  DW_AT_data_member_location	(0x50)

0x000003f5:     DW_TAG_member
                  DW_AT_name	("_IO_save_end")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(258)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x013d "char*")
                  DW_AT_data_member_location	(0x58)

0x00000403:     DW_TAG_member
                  DW_AT_name	("_markers")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(260)
                  DW_AT_decl_column	(0x16)
                  DW_AT_type	(cu + 0x04b9 "_IO_marker*")
                  DW_AT_data_member_location	(0x60)

0x00000411:     DW_TAG_member
                  DW_AT_name	("_chain")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(262)
                  DW_AT_decl_column	(0x14)
                  DW_AT_type	(cu + 0x04bf "_IO_FILE*")
                  DW_AT_data_member_location	(0x68)

0x0000041f:     DW_TAG_member
                  DW_AT_name	("_fileno")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(264)
                  DW_AT_decl_column	(0x07)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x70)

0x0000042d:     DW_TAG_member
                  DW_AT_name	("_flags2")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(268)
                  DW_AT_decl_column	(0x07)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x74)

0x0000043b:     DW_TAG_member
                  DW_AT_name	("_old_offset")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(270)
                  DW_AT_decl_column	(0x0d)
                  DW_AT_type	(cu + 0x00db "__off_t")
                  DW_AT_data_member_location	(0x78)

0x00000449:     DW_TAG_member
                  DW_AT_name	("_cur_column")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(274)
                  DW_AT_decl_column	(0x12)
                  DW_AT_type	(cu + 0x0034 "short unsigned int")
                  DW_AT_data_member_location	(0x80)

0x00000457:     DW_TAG_member
                  DW_AT_name	("_vtable_offset")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(275)
                  DW_AT_decl_column	(0x0f)
                  DW_AT_type	(cu + 0x0049 "signed char")
                  DW_AT_data_member_location	(0x82)

0x00000465:     DW_TAG_member
                  DW_AT_name	("_shortbuf")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(276)
                  DW_AT_decl_column	(0x08)
                  DW_AT_type	(cu + 0x04c5 "char[]")
                  DW_AT_data_member_location	(0x83)

0x00000473:     DW_TAG_member
                  DW_AT_name	("_lock")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(280)
                  DW_AT_decl_column	(0x0f)
                  DW_AT_type	(cu + 0x04d5 "_IO_lock_t*")
                  DW_AT_data_member_location	(0x88)

0x00000481:     DW_TAG_member
                  DW_AT_name	("_offset")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(289)
                  DW_AT_decl_column	(0x0f)
                  DW_AT_type	(cu + 0x00e7 "__off64_t")
                  DW_AT_data_member_location	(0x90)

0x0000048f:     DW_TAG_member
                  DW_AT_name	("__pad1")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(297)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x0117 "*")
                  DW_AT_data_member_location	(0x98)

0x0000049d:     DW_TAG_member
                  DW_AT_name	("__pad2")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(298)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x0117 "*")
                  DW_AT_data_member_location	(0xa0)

0x000004ab:     DW_TAG_member
                  DW_AT_name	("__pad3")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(299)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x0117 "*")
                  DW_AT_data_member_location	(0xa8)

0x000004b9:     DW_TAG_member
                  DW_AT_name	("__pad4")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(300)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x0117 "*")
                  DW_AT_data_member_location	(0xb0)

0x000004c7:     DW_TAG_member
                  DW_AT_name	("__pad5")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(302)
                  DW_AT_decl_column	(0x0a)
                  DW_AT_type	(cu + 0x01af "size_t")
                  DW_AT_data_member_location	(0xb8)

0x000004d5:     DW_TAG_member
                  DW_AT_name	("_mode")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(303)
                  DW_AT_decl_column	(0x07)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0xc0)

0x000004e3:     DW_TAG_member
                  DW_AT_name	("_unused2")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(305)
                  DW_AT_decl_column	(0x08)
                  DW_AT_type	(cu + 0x04db "char[]")
                  DW_AT_data_member_location	(0xc4)

0x000004f1:     NULL

0x000004f2:   DW_TAG_union_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/__mbstate_t.h")
                DW_AT_decl_line	(16)
                DW_AT_decl_column	(0x03)
                DW_AT_sibling	(cu + 0x044c)

0x000004fb:     DW_TAG_member
                  DW_AT_name	("__wch")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/__mbstate_t.h")
                  DW_AT_decl_line	(18)
                  DW_AT_decl_column	(0x13)
                  DW_AT_type	(cu + 0x003b "unsigned int")

0x00000507:     DW_TAG_member
                  DW_AT_name	("__wchb")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/__mbstate_t.h")
                  DW_AT_decl_line	(19)
                  DW_AT_decl_column	(0x0a)
                  DW_AT_type	(cu + 0x0236 "char[]")

0x00000513:     NULL

0x00000514:   DW_TAG_structure_type
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/__mbstate_t.h")
                DW_AT_decl_line	(13)
                DW_AT_decl_column	(0x09)
                DW_AT_sibling	(cu + 0x0470)

0x0000051d:     DW_TAG_member
                  DW_AT_name	("__count")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/__mbstate_t.h")
                  DW_AT_decl_line	(15)
                  DW_AT_decl_column	(0x07)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x00)

0x0000052a:     DW_TAG_member
                  DW_AT_name	("__value")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/__mbstate_t.h")
                  DW_AT_decl_line	(20)
                  DW_AT_decl_column	(0x05)
                  DW_AT_type	(cu + 0x042a "union ")
                  DW_AT_data_member_location	(0x04)

0x00000537:     NULL

0x00000538:   DW_TAG_typedef
                DW_AT_name	("__mbstate_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/__mbstate_t.h")
                DW_AT_decl_line	(21)
                DW_AT_decl_column	(0x03)
                DW_AT_type	(cu + 0x044c "structure ")

0x00000544:   DW_TAG_typedef
                DW_AT_name	("_IO_lock_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                DW_AT_decl_line	(150)
                DW_AT_decl_column	(0x0e)

0x0000054c:   DW_TAG_structure_type
                DW_AT_name	("_IO_marker")
                DW_AT_byte_size	(0x18)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                DW_AT_decl_line	(156)
                DW_AT_decl_column	(0x08)
                DW_AT_sibling	(cu + 0x04b9)

0x00000559:     DW_TAG_member
                  DW_AT_name	("_next")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(157)
                  DW_AT_decl_column	(0x16)
                  DW_AT_type	(cu + 0x04b9 "_IO_marker*")
                  DW_AT_data_member_location	(0x00)

0x00000566:     DW_TAG_member
                  DW_AT_name	("_sbuf")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(158)
                  DW_AT_decl_column	(0x14)
                  DW_AT_type	(cu + 0x04bf "_IO_FILE*")
                  DW_AT_data_member_location	(0x08)

0x00000573:     DW_TAG_member
                  DW_AT_name	("_pos")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                  DW_AT_decl_line	(162)
                  DW_AT_decl_column	(0x07)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x10)

0x00000580:     NULL

0x00000581:   DW_TAG_pointer_type
                DW_AT_byte_size	(0x08)
                DW_AT_type	(cu + 0x0484 "_IO_marker")

0x00000587:   DW_TAG_pointer_type
                DW_AT_byte_size	(0x08)
                DW_AT_type	(cu + 0x028f "_IO_FILE")

0x0000058d:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0143 "char")
                DW_AT_sibling	(cu + 0x04d5)

0x00000596:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0042 "long unsigned int")
                  DW_AT_upper_bound	(0x00)

0x0000059c:     NULL

0x0000059d:   DW_TAG_pointer_type
                DW_AT_byte_size	(0x08)
                DW_AT_type	(cu + 0x047c "_IO_lock_t")

0x000005a3:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0143 "char")
                DW_AT_sibling	(cu + 0x04eb)

0x000005ac:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0042 "long unsigned int")
                  DW_AT_upper_bound	(0x13)

0x000005b2:     NULL

0x000005b3:   DW_TAG_structure_type
                DW_AT_name	("_IO_FILE_plus")
                DW_AT_declaration	(true)

0x000005b8:   DW_TAG_variable
                DW_AT_name	("_IO_2_1_stdin_")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                DW_AT_decl_line	(315)
                DW_AT_decl_column	(0x1d)
                DW_AT_type	(cu + 0x04eb "_IO_FILE_plus")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x000005c5:   DW_TAG_variable
                DW_AT_name	("_IO_2_1_stdout_")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                DW_AT_decl_line	(316)
                DW_AT_decl_column	(0x1d)
                DW_AT_type	(cu + 0x04eb "_IO_FILE_plus")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x000005d2:   DW_TAG_variable
                DW_AT_name	("_IO_2_1_stderr_")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/libio.h")
                DW_AT_decl_line	(317)
                DW_AT_decl_column	(0x1d)
                DW_AT_type	(cu + 0x04eb "_IO_FILE_plus")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x000005df:   DW_TAG_pointer_type
                DW_AT_byte_size	(0x08)
                DW_AT_type	(cu + 0x014a "const char")

0x000005e5:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0517 "const char*")

0x000005ea:   DW_TAG_variable
                DW_AT_name	("stdin")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/stdio.h")
                DW_AT_decl_line	(135)
                DW_AT_decl_column	(0x19)
                DW_AT_type	(cu + 0x04bf "_IO_FILE*")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x000005f6:   DW_TAG_variable
                DW_AT_name	("stdout")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/stdio.h")
                DW_AT_decl_line	(136)
                DW_AT_decl_column	(0x19)
                DW_AT_type	(cu + 0x04bf "_IO_FILE*")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x00000602:   DW_TAG_variable
                DW_AT_name	("stderr")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/stdio.h")
                DW_AT_decl_line	(137)
                DW_AT_decl_column	(0x19)
                DW_AT_type	(cu + 0x04bf "_IO_FILE*")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x0000060e:   DW_TAG_variable
                DW_AT_name	("sys_nerr")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/sys_errlist.h")
                DW_AT_decl_line	(26)
                DW_AT_decl_column	(0x0c)
                DW_AT_type	(cu + 0x0057 "int")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x0000061a:   DW_TAG_array_type
                DW_AT_type	(cu + 0x051d "const const char*")
                DW_AT_sibling	(cu + 0x055d)

0x00000623:     DW_TAG_subrange_type

0x00000624:     NULL

0x00000625:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0552 "const const char*[]")

0x0000062a:   DW_TAG_variable
                DW_AT_name	("sys_errlist")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/sys_errlist.h")
                DW_AT_decl_line	(27)
                DW_AT_decl_column	(0x1a)
                DW_AT_type	(cu + 0x055d "const const const char*[]")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x00000636:   DW_TAG_variable
                DW_AT_name	("_sys_nerr")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/sys_errlist.h")
                DW_AT_decl_line	(30)
                DW_AT_decl_column	(0x0c)
                DW_AT_type	(cu + 0x0057 "int")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x00000642:   DW_TAG_variable
                DW_AT_name	("_sys_errlist")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/sys_errlist.h")
                DW_AT_decl_line	(31)
                DW_AT_decl_column	(0x1a)
                DW_AT_type	(cu + 0x055d "const const const char*[]")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x0000064e:   DW_TAG_typedef
                DW_AT_name	("ptrdiff_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/lib/gcc/x86_64-ubuntu-linux-gnu/8.2.0/include/stddef.h")
                DW_AT_decl_line	(149)
                DW_AT_decl_column	(0x1a)
                DW_AT_type	(cu + 0x0074 "long int")

0x0000065a:   DW_TAG_typedef
                DW_AT_name	("wchar_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/lib/gcc/x86_64-ubuntu-linux-gnu/8.2.0/include/stddef.h")
                DW_AT_decl_line	(328)
                DW_AT_decl_column	(0x18)
                DW_AT_type	(cu + 0x0057 "int")

0x00000667:   DW_TAG_base_type
                DW_AT_byte_size	(0x10)
                DW_AT_encoding	(DW_ATE_float)
                DW_AT_name	("long double")

0x0000066e:   DW_TAG_typedef
                DW_AT_name	("__jmp_buf")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/setjmp.h")
                DW_AT_decl_line	(31)
                DW_AT_decl_column	(0x12)
                DW_AT_type	(cu + 0x05b2 "long int[]")

0x0000067a:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0074 "long int")
                DW_AT_sibling	(cu + 0x05c2)

0x00000683:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0042 "long unsigned int")
                  DW_AT_upper_bound	(0x07)

0x00000689:     NULL

0x0000068a:   DW_TAG_structure_type
                DW_AT_name	("__jmp_buf_tag")
                DW_AT_byte_size	(0xc8)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/setjmp.h")
                DW_AT_decl_line	(33)
                DW_AT_decl_column	(0x08)
                DW_AT_sibling	(cu + 0x05f7)

0x00000697:     DW_TAG_member
                  DW_AT_name	("__jmpbuf")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/setjmp.h")
                  DW_AT_decl_line	(39)
                  DW_AT_decl_column	(0x0f)
                  DW_AT_type	(cu + 0x05a6 "__jmp_buf")
                  DW_AT_data_member_location	(0x00)

0x000006a4:     DW_TAG_member
                  DW_AT_name	("__mask_was_saved")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/setjmp.h")
                  DW_AT_decl_line	(40)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x40)

0x000006b1:     DW_TAG_member
                  DW_AT_name	("__saved_mask")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/setjmp.h")
                  DW_AT_decl_line	(41)
                  DW_AT_decl_column	(0x10)
                  DW_AT_type	(cu + 0x01e2 "__sigset_t")
                  DW_AT_data_member_location	(0x48)

0x000006be:     NULL

0x000006bf:   DW_TAG_typedef
                DW_AT_name	("jmp_buf")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/setjmp.h")
                DW_AT_decl_line	(45)
                DW_AT_decl_column	(0x1e)
                DW_AT_type	(cu + 0x0603 "__jmp_buf_tag[]")

0x000006cb:   DW_TAG_array_type
                DW_AT_type	(cu + 0x05c2 "__jmp_buf_tag")
                DW_AT_sibling	(cu + 0x0613)

0x000006d4:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0042 "long unsigned int")
                  DW_AT_upper_bound	(0x00)

0x000006da:     NULL

0x000006db:   DW_TAG_variable
                DW_AT_name	("optarg")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/getopt_core.h")
                DW_AT_decl_line	(36)
                DW_AT_decl_column	(0x0e)
                DW_AT_type	(cu + 0x013d "char*")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x000006e7:   DW_TAG_variable
                DW_AT_name	("optind")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/getopt_core.h")
                DW_AT_decl_line	(50)
                DW_AT_decl_column	(0x0c)
                DW_AT_type	(cu + 0x0057 "int")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x000006f3:   DW_TAG_variable
                DW_AT_name	("opterr")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/getopt_core.h")
                DW_AT_decl_line	(55)
                DW_AT_decl_column	(0x0c)
                DW_AT_type	(cu + 0x0057 "int")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x000006ff:   DW_TAG_variable
                DW_AT_name	("optopt")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/getopt_core.h")
                DW_AT_decl_line	(59)
                DW_AT_decl_column	(0x0c)
                DW_AT_type	(cu + 0x0057 "int")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x0000070b:   DW_TAG_pointer_type
                DW_AT_byte_size	(0x08)
                DW_AT_type	(cu + 0x0057 "int")

0x00000711:   DW_TAG_variable
                DW_AT_name	("rpl_optarg")
                DW_AT_decl_file	("/home/dongkwan/data/scripts/gnu_packages/coreutils/coreutils-8.29_gcc-8.2.0_x86_64_O0_debug/./lib/getopt-core.h")
                DW_AT_decl_line	(36)
                DW_AT_decl_column	(0x0e)
                DW_AT_type	(cu + 0x013d "char*")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x0000071d:   DW_TAG_variable
                DW_AT_name	("rpl_optind")
                DW_AT_decl_file	("/home/dongkwan/data/scripts/gnu_packages/coreutils/coreutils-8.29_gcc-8.2.0_x86_64_O0_debug/./lib/getopt-core.h")
                DW_AT_decl_line	(50)
                DW_AT_decl_column	(0x0c)
                DW_AT_type	(cu + 0x0057 "int")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x00000729:   DW_TAG_variable
                DW_AT_name	("rpl_opterr")
                DW_AT_decl_file	("/home/dongkwan/data/scripts/gnu_packages/coreutils/coreutils-8.29_gcc-8.2.0_x86_64_O0_debug/./lib/getopt-core.h")
                DW_AT_decl_line	(55)
                DW_AT_decl_column	(0x0c)
                DW_AT_type	(cu + 0x0057 "int")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x00000735:   DW_TAG_variable
                DW_AT_name	("rpl_optopt")
                DW_AT_decl_file	("/home/dongkwan/data/scripts/gnu_packages/coreutils/coreutils-8.29_gcc-8.2.0_x86_64_O0_debug/./lib/getopt-core.h")
                DW_AT_decl_line	(59)
                DW_AT_decl_column	(0x0c)
                DW_AT_type	(cu + 0x0057 "int")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x00000741:   DW_TAG_structure_type
                DW_AT_name	("rpl_option")
                DW_AT_byte_size	(0x20)
                DW_AT_decl_file	("/home/dongkwan/data/scripts/gnu_packages/coreutils/coreutils-8.29_gcc-8.2.0_x86_64_O0_debug/./lib/getopt-ext.h")
                DW_AT_decl_line	(50)
                DW_AT_decl_column	(0x08)
                DW_AT_sibling	(cu + 0x06bb)

0x0000074e:     DW_TAG_member
                  DW_AT_name	("name")
                  DW_AT_decl_file	("/home/dongkwan/data/scripts/gnu_packages/coreutils/coreutils-8.29_gcc-8.2.0_x86_64_O0_debug/./lib/getopt-ext.h")
                  DW_AT_decl_line	(52)
                  DW_AT_decl_column	(0x0f)
                  DW_AT_type	(cu + 0x0517 "const char*")
                  DW_AT_data_member_location	(0x00)

0x0000075b:     DW_TAG_member
                  DW_AT_name	("has_arg")
                  DW_AT_decl_file	("/home/dongkwan/data/scripts/gnu_packages/coreutils/coreutils-8.29_gcc-8.2.0_x86_64_O0_debug/./lib/getopt-ext.h")
                  DW_AT_decl_line	(55)
                  DW_AT_decl_column	(0x07)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x08)

0x00000768:     DW_TAG_member
                  DW_AT_name	("flag")
                  DW_AT_decl_file	("/home/dongkwan/data/scripts/gnu_packages/coreutils/coreutils-8.29_gcc-8.2.0_x86_64_O0_debug/./lib/getopt-ext.h")
                  DW_AT_decl_line	(56)
                  DW_AT_decl_column	(0x08)
                  DW_AT_type	(cu + 0x0643 "int*")
                  DW_AT_data_member_location	(0x10)

0x00000775:     DW_TAG_member
                  DW_AT_name	("val")
                  DW_AT_decl_file	("/home/dongkwan/data/scripts/gnu_packages/coreutils/coreutils-8.29_gcc-8.2.0_x86_64_O0_debug/./lib/getopt-ext.h")
                  DW_AT_decl_line	(57)
                  DW_AT_decl_column	(0x07)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x18)

0x00000782:     NULL

0x00000783:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0679 "rpl_option")

0x00000788:   DW_TAG_typedef
                DW_AT_name	("sig_atomic_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/sig_atomic_t.h")
                DW_AT_decl_line	(8)
                DW_AT_decl_column	(0x18)
                DW_AT_type	(cu + 0x014f "__sig_atomic_t")

0x00000794:   DW_TAG_volatile_type
                DW_AT_type	(cu + 0x06c0 "sig_atomic_t")

0x00000799:   DW_TAG_union_type
                DW_AT_name	("sigval")
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/sigval_t.h")
                DW_AT_decl_line	(5)
                DW_AT_decl_column	(0x07)
                DW_AT_sibling	(cu + 0x06f7)

0x000007a6:     DW_TAG_member
                  DW_AT_name	("sival_int")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/sigval_t.h")
                  DW_AT_decl_line	(7)
                  DW_AT_decl_column	(0x07)
                  DW_AT_type	(cu + 0x0057 "int")

0x000007b2:     DW_TAG_member
                  DW_AT_name	("sival_ptr")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/sigval_t.h")
                  DW_AT_decl_line	(8)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x0117 "*")

0x000007be:     NULL

0x000007bf:   DW_TAG_typedef
                DW_AT_name	("sigval_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/sigval_t.h")
                DW_AT_decl_line	(11)
                DW_AT_decl_column	(0x16)
                DW_AT_type	(cu + 0x06d1 "sigval")

0x000007cb:   DW_TAG_structure_type
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                DW_AT_decl_line	(56)
                DW_AT_decl_column	(0x02)
                DW_AT_sibling	(cu + 0x0727)

0x000007d4:     DW_TAG_member
                  DW_AT_name	("si_pid")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(58)
                  DW_AT_decl_column	(0x0e)
                  DW_AT_type	(cu + 0x00f3 "__pid_t")
                  DW_AT_data_member_location	(0x00)

0x000007e1:     DW_TAG_member
                  DW_AT_name	("si_uid")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(59)
                  DW_AT_decl_column	(0x0e)
                  DW_AT_type	(cu + 0x009f "__uid_t")
                  DW_AT_data_member_location	(0x04)

0x000007ee:     NULL

0x000007ef:   DW_TAG_structure_type
                DW_AT_byte_size	(0x10)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                DW_AT_decl_line	(63)
                DW_AT_decl_column	(0x02)
                DW_AT_sibling	(cu + 0x0758)

0x000007f8:     DW_TAG_member
                  DW_AT_name	("si_tid")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(65)
                  DW_AT_decl_column	(0x0a)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x00)

0x00000805:     DW_TAG_member
                  DW_AT_name	("si_overrun")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(66)
                  DW_AT_decl_column	(0x0a)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x04)

0x00000812:     DW_TAG_member
                  DW_AT_name	("si_sigval")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(67)
                  DW_AT_decl_column	(0x0f)
                  DW_AT_type	(cu + 0x06f7 "sigval_t")
                  DW_AT_data_member_location	(0x08)

0x0000081f:     NULL

0x00000820:   DW_TAG_structure_type
                DW_AT_byte_size	(0x10)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                DW_AT_decl_line	(71)
                DW_AT_decl_column	(0x02)
                DW_AT_sibling	(cu + 0x0789)

0x00000829:     DW_TAG_member
                  DW_AT_name	("si_pid")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(73)
                  DW_AT_decl_column	(0x0e)
                  DW_AT_type	(cu + 0x00f3 "__pid_t")
                  DW_AT_data_member_location	(0x00)

0x00000836:     DW_TAG_member
                  DW_AT_name	("si_uid")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(74)
                  DW_AT_decl_column	(0x0e)
                  DW_AT_type	(cu + 0x009f "__uid_t")
                  DW_AT_data_member_location	(0x04)

0x00000843:     DW_TAG_member
                  DW_AT_name	("si_sigval")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(75)
                  DW_AT_decl_column	(0x0f)
                  DW_AT_type	(cu + 0x06f7 "sigval_t")
                  DW_AT_data_member_location	(0x08)

0x00000850:     NULL

0x00000851:   DW_TAG_structure_type
                DW_AT_byte_size	(0x20)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                DW_AT_decl_line	(79)
                DW_AT_decl_column	(0x02)
                DW_AT_sibling	(cu + 0x07d4)

0x0000085a:     DW_TAG_member
                  DW_AT_name	("si_pid")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(81)
                  DW_AT_decl_column	(0x0e)
                  DW_AT_type	(cu + 0x00f3 "__pid_t")
                  DW_AT_data_member_location	(0x00)

0x00000867:     DW_TAG_member
                  DW_AT_name	("si_uid")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(82)
                  DW_AT_decl_column	(0x0e)
                  DW_AT_type	(cu + 0x009f "__uid_t")
                  DW_AT_data_member_location	(0x04)

0x00000874:     DW_TAG_member
                  DW_AT_name	("si_status")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(83)
                  DW_AT_decl_column	(0x0a)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x08)

0x00000881:     DW_TAG_member
                  DW_AT_name	("si_utime")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(84)
                  DW_AT_decl_column	(0x13)
                  DW_AT_type	(cu + 0x00ff "__clock_t")
                  DW_AT_data_member_location	(0x10)

0x0000088e:     DW_TAG_member
                  DW_AT_name	("si_stime")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(85)
                  DW_AT_decl_column	(0x13)
                  DW_AT_type	(cu + 0x00ff "__clock_t")
                  DW_AT_data_member_location	(0x18)

0x0000089b:     NULL

0x0000089c:   DW_TAG_structure_type
                DW_AT_byte_size	(0x10)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                DW_AT_decl_line	(97)
                DW_AT_decl_column	(0x03)
                DW_AT_sibling	(cu + 0x07f8)

0x000008a5:     DW_TAG_member
                  DW_AT_name	("_lower")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(99)
                  DW_AT_decl_column	(0x0d)
                  DW_AT_type	(cu + 0x0117 "*")
                  DW_AT_data_member_location	(0x00)

0x000008b2:     DW_TAG_member
                  DW_AT_name	("_upper")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(100)
                  DW_AT_decl_column	(0x0d)
                  DW_AT_type	(cu + 0x0117 "*")
                  DW_AT_data_member_location	(0x08)

0x000008bf:     NULL

0x000008c0:   DW_TAG_union_type
                DW_AT_byte_size	(0x10)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                DW_AT_decl_line	(94)
                DW_AT_decl_column	(0x06)
                DW_AT_sibling	(cu + 0x081a)

0x000008c9:     DW_TAG_member
                  DW_AT_name	("_addr_bnd")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(101)
                  DW_AT_decl_column	(0x07)
                  DW_AT_type	(cu + 0x07d4 "structure ")

0x000008d5:     DW_TAG_member
                  DW_AT_name	("_pkey")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(103)
                  DW_AT_decl_column	(0x0e)
                  DW_AT_type	(cu + 0x0068 "__uint32_t")

0x000008e1:     NULL

0x000008e2:   DW_TAG_structure_type
                DW_AT_byte_size	(0x20)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                DW_AT_decl_line	(89)
                DW_AT_decl_column	(0x02)
                DW_AT_sibling	(cu + 0x084b)

0x000008eb:     DW_TAG_member
                  DW_AT_name	("si_addr")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(91)
                  DW_AT_decl_column	(0x0c)
                  DW_AT_type	(cu + 0x0117 "*")
                  DW_AT_data_member_location	(0x00)

0x000008f8:     DW_TAG_member
                  DW_AT_name	("si_addr_lsb")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(93)
                  DW_AT_decl_column	(0x10)
                  DW_AT_type	(cu + 0x0050 "short int")
                  DW_AT_data_member_location	(0x08)

0x00000905:     DW_TAG_member
                  DW_AT_name	("_bounds")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(104)
                  DW_AT_decl_column	(0x0a)
                  DW_AT_type	(cu + 0x07f8 "union ")
                  DW_AT_data_member_location	(0x10)

0x00000912:     NULL

0x00000913:   DW_TAG_structure_type
                DW_AT_byte_size	(0x10)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                DW_AT_decl_line	(108)
                DW_AT_decl_column	(0x02)
                DW_AT_sibling	(cu + 0x086f)

0x0000091c:     DW_TAG_member
                  DW_AT_name	("si_band")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(110)
                  DW_AT_decl_column	(0x0f)
                  DW_AT_type	(cu + 0x0074 "long int")
                  DW_AT_data_member_location	(0x00)

0x00000929:     DW_TAG_member
                  DW_AT_name	("si_fd")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(111)
                  DW_AT_decl_column	(0x0a)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x08)

0x00000936:     NULL

0x00000937:   DW_TAG_structure_type
                DW_AT_byte_size	(0x10)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                DW_AT_decl_line	(116)
                DW_AT_decl_column	(0x02)
                DW_AT_sibling	(cu + 0x08a0)

0x00000940:     DW_TAG_member
                  DW_AT_name	("_call_addr")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(118)
                  DW_AT_decl_column	(0x0c)
                  DW_AT_type	(cu + 0x0117 "*")
                  DW_AT_data_member_location	(0x00)

0x0000094d:     DW_TAG_member
                  DW_AT_name	("_syscall")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(119)
                  DW_AT_decl_column	(0x0a)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x08)

0x0000095a:     DW_TAG_member
                  DW_AT_name	("_arch")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(120)
                  DW_AT_decl_column	(0x13)
                  DW_AT_type	(cu + 0x003b "unsigned int")
                  DW_AT_data_member_location	(0x0c)

0x00000967:     NULL

0x00000968:   DW_TAG_union_type
                DW_AT_byte_size	(0x70)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                DW_AT_decl_line	(51)
                DW_AT_decl_column	(0x05)
                DW_AT_sibling	(cu + 0x090a)

0x00000971:     DW_TAG_member
                  DW_AT_name	("_pad")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(53)
                  DW_AT_decl_column	(0x06)
                  DW_AT_type	(cu + 0x090a "int[]")

0x0000097d:     DW_TAG_member
                  DW_AT_name	("_kill")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(60)
                  DW_AT_decl_column	(0x06)
                  DW_AT_type	(cu + 0x0703 "structure ")

0x00000989:     DW_TAG_member
                  DW_AT_name	("_timer")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(68)
                  DW_AT_decl_column	(0x06)
                  DW_AT_type	(cu + 0x0727 "structure ")

0x00000995:     DW_TAG_member
                  DW_AT_name	("_rt")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(76)
                  DW_AT_decl_column	(0x06)
                  DW_AT_type	(cu + 0x0758 "structure ")

0x000009a1:     DW_TAG_member
                  DW_AT_name	("_sigchld")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(86)
                  DW_AT_decl_column	(0x06)
                  DW_AT_type	(cu + 0x0789 "structure ")

0x000009ad:     DW_TAG_member
                  DW_AT_name	("_sigfault")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(105)
                  DW_AT_decl_column	(0x06)
                  DW_AT_type	(cu + 0x081a "structure ")

0x000009b9:     DW_TAG_member
                  DW_AT_name	("_sigpoll")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(112)
                  DW_AT_decl_column	(0x06)
                  DW_AT_type	(cu + 0x084b "structure ")

0x000009c5:     DW_TAG_member
                  DW_AT_name	("_sigsys")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(121)
                  DW_AT_decl_column	(0x06)
                  DW_AT_type	(cu + 0x086f "structure ")

0x000009d1:     NULL

0x000009d2:   DW_TAG_array_type
                DW_AT_type	(cu + 0x0057 "int")
                DW_AT_sibling	(cu + 0x091a)

0x000009db:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0042 "long unsigned int")
                  DW_AT_upper_bound	(0x1b)

0x000009e1:     NULL

0x000009e2:   DW_TAG_structure_type
                DW_AT_byte_size	(0x80)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                DW_AT_decl_line	(36)
                DW_AT_decl_column	(0x09)
                DW_AT_sibling	(cu + 0x0965)

0x000009eb:     DW_TAG_member
                  DW_AT_name	("si_signo")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(38)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x00)

0x000009f8:     DW_TAG_member
                  DW_AT_name	("si_errno")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(40)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x04)

0x00000a05:     DW_TAG_member
                  DW_AT_name	("si_code")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(42)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x08)

0x00000a12:     DW_TAG_member
                  DW_AT_name	("__pad0")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(48)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x0c)

0x00000a1f:     DW_TAG_member
                  DW_AT_name	("_sifields")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                  DW_AT_decl_line	(123)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x08a0 "union ")
                  DW_AT_data_member_location	(0x10)

0x00000a2c:     NULL

0x00000a2d:   DW_TAG_typedef
                DW_AT_name	("siginfo_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/siginfo_t.h")
                DW_AT_decl_line	(124)
                DW_AT_decl_column	(0x05)
                DW_AT_type	(cu + 0x091a "structure ")

0x00000a39:   DW_TAG_typedef
                DW_AT_name	("__sighandler_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/signal.h")
                DW_AT_decl_line	(68)
                DW_AT_decl_column	(0x10)
                DW_AT_type	(cu + 0x097d "subroutine *")

0x00000a45:   DW_TAG_pointer_type
                DW_AT_byte_size	(0x08)
                DW_AT_type	(cu + 0x0983 "subroutine ")

0x00000a4b:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)
                DW_AT_sibling	(cu + 0x098e)

0x00000a50:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0057 "int")

0x00000a55:     NULL

0x00000a56:   DW_TAG_union_type
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/sigaction.h")
                DW_AT_decl_line	(28)
                DW_AT_decl_column	(0x05)
                DW_AT_sibling	(cu + 0x09b0)

0x00000a5f:     DW_TAG_member
                  DW_AT_name	("sa_handler")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/sigaction.h")
                  DW_AT_decl_line	(31)
                  DW_AT_decl_column	(0x11)
                  DW_AT_type	(cu + 0x0971 "__sighandler_t")

0x00000a6b:     DW_TAG_member
                  DW_AT_name	("sa_sigaction")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/sigaction.h")
                  DW_AT_decl_line	(33)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x09cb "subroutine *")

0x00000a77:     NULL

0x00000a78:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)
                DW_AT_sibling	(cu + 0x09c5)

0x00000a7d:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0057 "int")

0x00000a82:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x09c5 "siginfo_t*")

0x00000a87:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0117 "*")

0x00000a8c:     NULL

0x00000a8d:   DW_TAG_pointer_type
                DW_AT_byte_size	(0x08)
                DW_AT_type	(cu + 0x0965 "siginfo_t")

0x00000a93:   DW_TAG_pointer_type
                DW_AT_byte_size	(0x08)
                DW_AT_type	(cu + 0x09b0 "subroutine ")

0x00000a99:   DW_TAG_structure_type
                DW_AT_name	("sigaction")
                DW_AT_byte_size	(0x98)
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/sigaction.h")
                DW_AT_decl_line	(24)
                DW_AT_decl_column	(0x08)
                DW_AT_sibling	(cu + 0x0a13)

0x00000aa6:     DW_TAG_member
                  DW_AT_name	("__sigaction_handler")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/sigaction.h")
                  DW_AT_decl_line	(35)
                  DW_AT_decl_column	(0x05)
                  DW_AT_type	(cu + 0x098e "union ")
                  DW_AT_data_member_location	(0x00)

0x00000ab3:     DW_TAG_member
                  DW_AT_name	("sa_mask")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/sigaction.h")
                  DW_AT_decl_line	(43)
                  DW_AT_decl_column	(0x10)
                  DW_AT_type	(cu + 0x01e2 "__sigset_t")
                  DW_AT_data_member_location	(0x08)

0x00000ac0:     DW_TAG_member
                  DW_AT_name	("sa_flags")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/sigaction.h")
                  DW_AT_decl_line	(46)
                  DW_AT_decl_column	(0x09)
                  DW_AT_type	(cu + 0x0057 "int")
                  DW_AT_data_member_location	(0x88)

0x00000acd:     DW_TAG_member
                  DW_AT_name	("sa_restorer")
                  DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/sigaction.h")
                  DW_AT_decl_line	(49)
                  DW_AT_decl_column	(0x0c)
                  DW_AT_type	(cu + 0x0a19 "subroutine *")
                  DW_AT_data_member_location	(0x90)

0x00000ada:     NULL

0x00000adb:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000adc:   DW_TAG_volatile_type
                DW_AT_type	(cu + 0x0a13 "subroutine ")

0x00000ae1:   DW_TAG_pointer_type
                DW_AT_byte_size	(0x08)
                DW_AT_type	(cu + 0x0a13 "subroutine ")

0x00000ae7:   DW_TAG_array_type
                DW_AT_type	(cu + 0x051d "const const char*")
                DW_AT_sibling	(cu + 0x0a2f)

0x00000af0:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x0042 "long unsigned int")
                  DW_AT_upper_bound	(0x40)

0x00000af6:     NULL

0x00000af7:   DW_TAG_const_type
                DW_AT_type	(cu + 0x0a1f "const const char*[]")

0x00000afc:   DW_TAG_variable
                DW_AT_name	("_sys_siglist")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/signal.h")
                DW_AT_decl_line	(282)
                DW_AT_decl_column	(0x1a)
                DW_AT_type	(cu + 0x0a2f "const const const char*[]")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x00000b09:   DW_TAG_variable
                DW_AT_name	("sys_siglist")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/signal.h")
                DW_AT_decl_line	(283)
                DW_AT_decl_column	(0x1a)
                DW_AT_type	(cu + 0x0a2f "const const const char*[]")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x00000b16:   DW_TAG_variable
                DW_AT_name	("program_invocation_name")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/errno.h")
                DW_AT_decl_line	(45)
                DW_AT_decl_column	(0x0e)
                DW_AT_type	(cu + 0x013d "char*")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x00000b22:   DW_TAG_variable
                DW_AT_name	("program_invocation_short_name")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/errno.h")
                DW_AT_decl_line	(46)
                DW_AT_decl_column	(0x0e)
                DW_AT_type	(cu + 0x013d "char*")
                DW_AT_external	(true)
                DW_AT_declaration	(true)

0x00000b2e:   DW_TAG_typedef
                DW_AT_name	("mbstate_t")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/bits/types/mbstate_t.h")
                DW_AT_decl_line	(6)
                DW_AT_decl_column	(0x15)
                DW_AT_type	(cu + 0x0470 "__mbstate_t")

0x00000b3a:   DW_TAG_enumeration_type
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)
                DW_AT_type	(cu + 0x003b "unsigned int")
                DW_AT_decl_file	("/home/dongkwan/x-tools/x86_64-ubuntu-linux-gnu-8.2.0/x86_64-ubuntu-linux-gnu/sysroot/usr/include/langinfo.h")
                DW_AT_decl_line	(42)
                DW_AT_decl_column	(0x01)
                DW_AT_sibling	(cu + 0x1540)

0x00000b48:     DW_TAG_enumerator
                  DW_AT_name	("ABDAY_1")
                  DW_AT_const_value	(0x00020000)

0x00000b51:     DW_TAG_enumerator
                  DW_AT_name	("ABDAY_2")
                  DW_AT_const_value	(0x00020001)

0x00000b5a:     DW_TAG_enumerator
                  DW_AT_name	("ABDAY_3")
                  DW_AT_const_value	(0x00020002)

0x00000b63:     DW_TAG_enumerator
                  DW_AT_name	("ABDAY_4")
                  DW_AT_const_value	(0x00020003)

0x00000b6c:     DW_TAG_enumerator
                  DW_AT_name	("ABDAY_5")
                  DW_AT_const_value	(0x00020004)

0x00000b75:     DW_TAG_enumerator
                  DW_AT_name	("ABDAY_6")
                  DW_AT_const_value	(0x00020005)

0x00000b7e:     DW_TAG_enumerator
                  DW_AT_name	("ABDAY_7")
                  DW_AT_const_value	(0x00020006)

0x00000b87:     DW_TAG_enumerator
                  DW_AT_name	("DAY_1")
                  DW_AT_const_value	(0x00020007)

0x00000b90:     DW_TAG_enumerator
                  DW_AT_name	("DAY_2")
                  DW_AT_const_value	(0x00020008)

0x00000b99:     DW_TAG_enumerator
                  DW_AT_name	("DAY_3")
                  DW_AT_const_value	(0x00020009)

0x00000ba2:     DW_TAG_enumerator
                  DW_AT_name	("DAY_4")
                  DW_AT_const_value	(0x0002000a)

0x00000bab:     DW_TAG_enumerator
                  DW_AT_name	("DAY_5")
                  DW_AT_const_value	(0x0002000b)

0x00000bb4:     DW_TAG_enumerator
                  DW_AT_name	("DAY_6")
                  DW_AT_const_value	(0x0002000c)

0x00000bbd:     DW_TAG_enumerator
                  DW_AT_name	("DAY_7")
                  DW_AT_const_value	(0x0002000d)

0x00000bc6:     DW_TAG_enumerator
                  DW_AT_name	("ABMON_1")
                  DW_AT_const_value	(0x0002000e)

0x00000bcf:     DW_TAG_enumerator
                  DW_AT_name	("ABMON_2")
                  DW_AT_const_value	(0x0002000f)

0x00000bd8:     DW_TAG_enumerator
                  DW_AT_name	("ABMON_3")
                  DW_AT_const_value	(0x00020010)

0x00000be1:     DW_TAG_enumerator
                  DW_AT_name	("ABMON_4")
                  DW_AT_const_value	(0x00020011)

0x00000bea:     DW_TAG_enumerator
                  DW_AT_name	("ABMON_5")
                  DW_AT_const_value	(0x00020012)

0x00000bf3:     DW_TAG_enumerator
                  DW_AT_name	("ABMON_6")
                  DW_AT_const_value	(0x00020013)

0x00000bfc:     DW_TAG_enumerator
                  DW_AT_name	("ABMON_7")
                  DW_AT_const_value	(0x00020014)

0x00000c05:     DW_TAG_enumerator
                  DW_AT_name	("ABMON_8")
                  DW_AT_const_value	(0x00020015)

0x00000c0e:     DW_TAG_enumerator
                  DW_AT_name	("ABMON_9")
                  DW_AT_const_value	(0x00020016)

0x00000c17:     DW_TAG_enumerator
                  DW_AT_name	("ABMON_10")
                  DW_AT_const_value	(0x00020017)

0x00000c20:     DW_TAG_enumerator
                  DW_AT_name	("ABMON_11")
                  DW_AT_const_value	(0x00020018)

0x00000c29:     DW_TAG_enumerator
                  DW_AT_name	("ABMON_12")
                  DW_AT_const_value	(0x00020019)

0x00000c32:     DW_TAG_enumerator
                  DW_AT_name	("MON_1")
                  DW_AT_const_value	(0x0002001a)

0x00000c3b:     DW_TAG_enumerator
                  DW_AT_name	("MON_2")
                  DW_AT_const_value	(0x0002001b)

0x00000c44:     DW_TAG_enumerator
                  DW_AT_name	("MON_3")
                  DW_AT_const_value	(0x0002001c)

0x00000c4d:     DW_TAG_enumerator
                  DW_AT_name	("MON_4")
                  DW_AT_const_value	(0x0002001d)

0x00000c56:     DW_TAG_enumerator
                  DW_AT_name	("MON_5")
                  DW_AT_const_value	(0x0002001e)

0x00000c5f:     DW_TAG_enumerator
                  DW_AT_name	("MON_6")
                  DW_AT_const_value	(0x0002001f)

0x00000c68:     DW_TAG_enumerator
                  DW_AT_name	("MON_7")
                  DW_AT_const_value	(0x00020020)

0x00000c71:     DW_TAG_enumerator
                  DW_AT_name	("MON_8")
                  DW_AT_const_value	(0x00020021)

0x00000c7a:     DW_TAG_enumerator
                  DW_AT_name	("MON_9")
                  DW_AT_const_value	(0x00020022)

0x00000c83:     DW_TAG_enumerator
                  DW_AT_name	("MON_10")
                  DW_AT_const_value	(0x00020023)

0x00000c8c:     DW_TAG_enumerator
                  DW_AT_name	("MON_11")
                  DW_AT_const_value	(0x00020024)

0x00000c95:     DW_TAG_enumerator
                  DW_AT_name	("MON_12")
                  DW_AT_const_value	(0x00020025)

0x00000c9e:     DW_TAG_enumerator
                  DW_AT_name	("AM_STR")
                  DW_AT_const_value	(0x00020026)

0x00000ca7:     DW_TAG_enumerator
                  DW_AT_name	("PM_STR")
                  DW_AT_const_value	(0x00020027)

0x00000cb0:     DW_TAG_enumerator
                  DW_AT_name	("D_T_FMT")
                  DW_AT_const_value	(0x00020028)

0x00000cb9:     DW_TAG_enumerator
                  DW_AT_name	("D_FMT")
                  DW_AT_const_value	(0x00020029)

0x00000cc2:     DW_TAG_enumerator
                  DW_AT_name	("T_FMT")
                  DW_AT_const_value	(0x0002002a)

0x00000ccb:     DW_TAG_enumerator
                  DW_AT_name	("T_FMT_AMPM")
                  DW_AT_const_value	(0x0002002b)

0x00000cd4:     DW_TAG_enumerator
                  DW_AT_name	("ERA")
                  DW_AT_const_value	(0x0002002c)

0x00000cdd:     DW_TAG_enumerator
                  DW_AT_name	("__ERA_YEAR")
                  DW_AT_const_value	(0x0002002d)

0x00000ce6:     DW_TAG_enumerator
                  DW_AT_name	("ERA_D_FMT")
                  DW_AT_const_value	(0x0002002e)

0x00000cef:     DW_TAG_enumerator
                  DW_AT_name	("ALT_DIGITS")
                  DW_AT_const_value	(0x0002002f)

0x00000cf8:     DW_TAG_enumerator
                  DW_AT_name	("ERA_D_T_FMT")
                  DW_AT_const_value	(0x00020030)

0x00000d01:     DW_TAG_enumerator
                  DW_AT_name	("ERA_T_FMT")
                  DW_AT_const_value	(0x00020031)

0x00000d0a:     DW_TAG_enumerator
                  DW_AT_name	("_NL_TIME_ERA_NUM_ENTRIES")
                  DW_AT_const_value	(0x00020032)

0x00000d13:     DW_TAG_enumerator
                  DW_AT_name	("_NL_TIME_ERA_ENTRIES")
                  DW_AT_const_value	(0x00020033)

0x00000d1c:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABDAY_1")
                  DW_AT_const_value	(0x00020034)

0x00000d25:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABDAY_2")
                  DW_AT_const_value	(0x00020035)

0x00000d2e:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABDAY_3")
                  DW_AT_const_value	(0x00020036)

0x00000d37:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABDAY_4")
                  DW_AT_const_value	(0x00020037)

0x00000d40:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABDAY_5")
                  DW_AT_const_value	(0x00020038)

0x00000d49:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABDAY_6")
                  DW_AT_const_value	(0x00020039)

0x00000d52:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABDAY_7")
                  DW_AT_const_value	(0x0002003a)

0x00000d5b:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WDAY_1")
                  DW_AT_const_value	(0x0002003b)

0x00000d64:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WDAY_2")
                  DW_AT_const_value	(0x0002003c)

0x00000d6d:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WDAY_3")
                  DW_AT_const_value	(0x0002003d)

0x00000d76:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WDAY_4")
                  DW_AT_const_value	(0x0002003e)

0x00000d7f:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WDAY_5")
                  DW_AT_const_value	(0x0002003f)

0x00000d88:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WDAY_6")
                  DW_AT_const_value	(0x00020040)

0x00000d91:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WDAY_7")
                  DW_AT_const_value	(0x00020041)

0x00000d9a:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABMON_1")
                  DW_AT_const_value	(0x00020042)

0x00000da3:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABMON_2")
                  DW_AT_const_value	(0x00020043)

0x00000dac:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABMON_3")
                  DW_AT_const_value	(0x00020044)

0x00000db5:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABMON_4")
                  DW_AT_const_value	(0x00020045)

0x00000dbe:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABMON_5")
                  DW_AT_const_value	(0x00020046)

0x00000dc7:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABMON_6")
                  DW_AT_const_value	(0x00020047)

0x00000dd0:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABMON_7")
                  DW_AT_const_value	(0x00020048)

0x00000dd9:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABMON_8")
                  DW_AT_const_value	(0x00020049)

0x00000de2:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABMON_9")
                  DW_AT_const_value	(0x0002004a)

0x00000deb:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABMON_10")
                  DW_AT_const_value	(0x0002004b)

0x00000df4:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABMON_11")
                  DW_AT_const_value	(0x0002004c)

0x00000dfd:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WABMON_12")
                  DW_AT_const_value	(0x0002004d)

0x00000e06:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WMON_1")
                  DW_AT_const_value	(0x0002004e)

0x00000e0f:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WMON_2")
                  DW_AT_const_value	(0x0002004f)

0x00000e18:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WMON_3")
                  DW_AT_const_value	(0x00020050)

0x00000e21:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WMON_4")
                  DW_AT_const_value	(0x00020051)

0x00000e2a:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WMON_5")
                  DW_AT_const_value	(0x00020052)

0x00000e33:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WMON_6")
                  DW_AT_const_value	(0x00020053)

0x00000e3c:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WMON_7")
                  DW_AT_const_value	(0x00020054)

0x00000e45:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WMON_8")
                  DW_AT_const_value	(0x00020055)

0x00000e4e:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WMON_9")
                  DW_AT_const_value	(0x00020056)

0x00000e57:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WMON_10")
                  DW_AT_const_value	(0x00020057)

0x00000e60:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WMON_11")
                  DW_AT_const_value	(0x00020058)

0x00000e69:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WMON_12")
                  DW_AT_const_value	(0x00020059)

0x00000e72:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WAM_STR")
                  DW_AT_const_value	(0x0002005a)

0x00000e7b:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WPM_STR")
                  DW_AT_const_value	(0x0002005b)

0x00000e84:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WD_T_FMT")
                  DW_AT_const_value	(0x0002005c)

0x00000e8d:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WD_FMT")
                  DW_AT_const_value	(0x0002005d)

0x00000e96:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WT_FMT")
                  DW_AT_const_value	(0x0002005e)

0x00000e9f:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WT_FMT_AMPM")
                  DW_AT_const_value	(0x0002005f)

0x00000ea8:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WERA_YEAR")
                  DW_AT_const_value	(0x00020060)

0x00000eb1:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WERA_D_FMT")
                  DW_AT_const_value	(0x00020061)

0x00000eba:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WALT_DIGITS")
                  DW_AT_const_value	(0x00020062)

0x00000ec3:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WERA_D_T_FMT")
                  DW_AT_const_value	(0x00020063)

0x00000ecc:     DW_TAG_enumerator
                  DW_AT_name	("_NL_WERA_T_FMT")
                  DW_AT_const_value	(0x00020064)

0x00000ed5:     DW_TAG_enumerator
                  DW_AT_name	("_NL_TIME_WEEK_NDAYS")
                  DW_AT_const_value	(0x00020065)

0x00000ede:     DW_TAG_enumerator
                  DW_AT_name	("_NL_TIME_WEEK_1STDAY")
                  DW_AT_const_value	(0x00020066)

0x00000ee7:     DW_TAG_enumerator
                  DW_AT_name	("_NL_TIME_WEEK_1STWEEK")
                  DW_AT_const_value	(0x00020067)

0x00000ef0:     DW_TAG_enumerator
                  DW_AT_name	("_NL_TIME_FIRST_WEEKDAY")
                  DW_AT_const_value	(0x00020068)

0x00000ef9:     DW_TAG_enumerator
                  DW_AT_name	("_NL_TIME_FIRST_WORKDAY")
                  DW_AT_const_value	(0x00020069)

0x00000f02:     DW_TAG_enumerator
                  DW_AT_name	("_NL_TIME_CAL_DIRECTION")
                  DW_AT_const_value	(0x0002006a)

0x00000f0b:     DW_TAG_enumerator
                  DW_AT_name	("_NL_TIME_TIMEZONE")
                  DW_AT_const_value	(0x0002006b)

0x00000f14:     DW_TAG_enumerator
                  DW_AT_name	("_DATE_FMT")
                  DW_AT_const_value	(0x0002006c)

0x00000f1d:     DW_TAG_enumerator
                  DW_AT_name	("_NL_W_DATE_FMT")
                  DW_AT_const_value	(0x0002006d)

0x00000f26:     DW_TAG_enumerator
                  DW_AT_name	("_NL_TIME_CODESET")
                  DW_AT_const_value	(0x0002006e)

0x00000f2f:     DW_TAG_enumerator
                  DW_AT_name	("_NL_NUM_LC_TIME")
                  DW_AT_const_value	(0x0002006f)

0x00000f38:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_NRULES")
                  DW_AT_const_value	(0x00030000)

0x00000f41:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_RULESETS")
                  DW_AT_const_value	(0x00030001)

0x00000f4a:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_TABLEMB")
                  DW_AT_const_value	(0x00030002)

0x00000f53:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_WEIGHTMB")
                  DW_AT_const_value	(0x00030003)

0x00000f5c:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_EXTRAMB")
                  DW_AT_const_value	(0x00030004)

0x00000f65:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_INDIRECTMB")
                  DW_AT_const_value	(0x00030005)

0x00000f6e:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_GAP1")
                  DW_AT_const_value	(0x00030006)

0x00000f77:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_GAP2")
                  DW_AT_const_value	(0x00030007)

0x00000f80:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_GAP3")
                  DW_AT_const_value	(0x00030008)

0x00000f89:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_TABLEWC")
                  DW_AT_const_value	(0x00030009)

0x00000f92:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_WEIGHTWC")
                  DW_AT_const_value	(0x0003000a)

0x00000f9b:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_EXTRAWC")
                  DW_AT_const_value	(0x0003000b)

0x00000fa4:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_INDIRECTWC")
                  DW_AT_const_value	(0x0003000c)

0x00000fad:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_SYMB_HASH_SIZEMB")
                  DW_AT_const_value	(0x0003000d)

0x00000fb6:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_SYMB_TABLEMB")
                  DW_AT_const_value	(0x0003000e)

0x00000fbf:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_SYMB_EXTRAMB")
                  DW_AT_const_value	(0x0003000f)

0x00000fc8:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_COLLSEQMB")
                  DW_AT_const_value	(0x00030010)

0x00000fd1:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_COLLSEQWC")
                  DW_AT_const_value	(0x00030011)

0x00000fda:     DW_TAG_enumerator
                  DW_AT_name	("_NL_COLLATE_CODESET")
                  DW_AT_const_value	(0x00030012)

0x00000fe3:     DW_TAG_enumerator
                  DW_AT_name	("_NL_NUM_LC_COLLATE")
                  DW_AT_const_value	(0x00030013)

0x00000fec:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_CLASS")
                  DW_AT_const_value	(0x00)

0x00000ff2:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_TOUPPER")
                  DW_AT_const_value	(0x01)

0x00000ff8:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_GAP1")
                  DW_AT_const_value	(0x02)

0x00000ffe:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_TOLOWER")
                  DW_AT_const_value	(0x03)

0x00001004:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_GAP2")
                  DW_AT_const_value	(0x04)

0x0000100a:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_CLASS32")
                  DW_AT_const_value	(0x05)

0x00001010:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_GAP3")
                  DW_AT_const_value	(0x06)

0x00001016:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_GAP4")
                  DW_AT_const_value	(0x07)

0x0000101c:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_GAP5")
                  DW_AT_const_value	(0x08)

0x00001022:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_GAP6")
                  DW_AT_const_value	(0x09)

0x00001028:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_CLASS_NAMES")
                  DW_AT_const_value	(0x0a)

0x0000102e:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_MAP_NAMES")
                  DW_AT_const_value	(0x0b)

0x00001034:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_WIDTH")
                  DW_AT_const_value	(0x0c)

0x0000103a:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_MB_CUR_MAX")
                  DW_AT_const_value	(0x0d)

0x00001040:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_CODESET_NAME")
                  DW_AT_const_value	(0x0e)

0x00001046:     DW_TAG_enumerator
                  DW_AT_name	("CODESET")
                  DW_AT_const_value	(0x0e)

0x0000104c:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_TOUPPER32")
                  DW_AT_const_value	(0x0f)

0x00001052:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_TOLOWER32")
                  DW_AT_const_value	(0x10)

0x00001058:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_CLASS_OFFSET")
                  DW_AT_const_value	(0x11)

0x0000105e:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_MAP_OFFSET")
                  DW_AT_const_value	(0x12)

0x00001064:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS_MB_LEN")
                  DW_AT_const_value	(0x13)

0x0000106a:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS0_MB")
                  DW_AT_const_value	(0x14)

0x00001070:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS1_MB")
                  DW_AT_const_value	(0x15)

0x00001076:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS2_MB")
                  DW_AT_const_value	(0x16)

0x0000107c:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS3_MB")
                  DW_AT_const_value	(0x17)

0x00001082:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS4_MB")
                  DW_AT_const_value	(0x18)

0x00001088:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS5_MB")
                  DW_AT_const_value	(0x19)

0x0000108e:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS6_MB")
                  DW_AT_const_value	(0x1a)

0x00001094:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS7_MB")
                  DW_AT_const_value	(0x1b)

0x0000109a:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS8_MB")
                  DW_AT_const_value	(0x1c)

0x000010a0:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS9_MB")
                  DW_AT_const_value	(0x1d)

0x000010a6:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS_WC_LEN")
                  DW_AT_const_value	(0x1e)

0x000010ac:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS0_WC")
                  DW_AT_const_value	(0x1f)

0x000010b2:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS1_WC")
                  DW_AT_const_value	(0x20)

0x000010b8:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS2_WC")
                  DW_AT_const_value	(0x21)

0x000010be:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS3_WC")
                  DW_AT_const_value	(0x22)

0x000010c4:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS4_WC")
                  DW_AT_const_value	(0x23)

0x000010ca:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS5_WC")
                  DW_AT_const_value	(0x24)

0x000010d0:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS6_WC")
                  DW_AT_const_value	(0x25)

0x000010d6:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS7_WC")
                  DW_AT_const_value	(0x26)

0x000010dc:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS8_WC")
                  DW_AT_const_value	(0x27)

0x000010e2:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_INDIGITS9_WC")
                  DW_AT_const_value	(0x28)

0x000010e8:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT0_MB")
                  DW_AT_const_value	(0x29)

0x000010ee:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT1_MB")
                  DW_AT_const_value	(0x2a)

0x000010f4:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT2_MB")
                  DW_AT_const_value	(0x2b)

0x000010fa:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT3_MB")
                  DW_AT_const_value	(0x2c)

0x00001100:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT4_MB")
                  DW_AT_const_value	(0x2d)

0x00001106:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT5_MB")
                  DW_AT_const_value	(0x2e)

0x0000110c:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT6_MB")
                  DW_AT_const_value	(0x2f)

0x00001112:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT7_MB")
                  DW_AT_const_value	(0x30)

0x00001118:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT8_MB")
                  DW_AT_const_value	(0x31)

0x0000111e:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT9_MB")
                  DW_AT_const_value	(0x32)

0x00001124:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT0_WC")
                  DW_AT_const_value	(0x33)

0x0000112a:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT1_WC")
                  DW_AT_const_value	(0x34)

0x00001130:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT2_WC")
                  DW_AT_const_value	(0x35)

0x00001136:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT3_WC")
                  DW_AT_const_value	(0x36)

0x0000113c:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT4_WC")
                  DW_AT_const_value	(0x37)

0x00001142:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT5_WC")
                  DW_AT_const_value	(0x38)

0x00001148:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT6_WC")
                  DW_AT_const_value	(0x39)

0x0000114e:     DW_TAG_enumerator
                  DW_AT_name	("_NL_CTYPE_OUTDIGIT7_WC")
                  DW_AT_const_value	(0x3a)

0x00001154:     DW_TAG_enumerator
